/*TODO:task
    На основании класса House создайте класс Skyscraper (небоскреб, по сути реализуйте через наследование). Данный класс кроме свойств length, width и floors должен предоставлять дополнительное свойство offices(количество выделенных в офисе задний, можете задать их любым на ваше усмотрение);
	  Добавьте свойство fullArea который будет соответствовать суммарной площади всех этажей вашего небоскреба. Данное свойсвто создать через get/set.
 	  При этом если площадь небоскреба увеличилась - то это значит что сверху построили еще этажи, а длина и ширина не поменялись, площадь может быть только увеличена. Опишите в get как будет осуществляться подсчет площади и вывод этой площадь, а в set определите как будет определяться новое количесвто этажей.
* */